<p>Правильно искать информацию в сети – важно. Подберёшь неправильный запрос – не найдёшь нужной ссылки.
Иногда приходится делать много попыток, чтобы найти то, что надо. Тратишь полчаса на поиск решения проблемы,
а какой-нибудь Вася найдёт то же, но за один запрос.</p>
<p>В итоге правильное использование поиска не только позволяет экономить время, но и не чувствовать себя идиотом.</p>
<blockquote>
<p>Это же чёртов поиск, написал запрос – увидел результат. Чего сложного?</p>
</blockquote>
<p>Сложно написать запрос правильно. Оказывается, Гугл умеет много вещей, которые очень помогают искать информацию.
Их надо знать и использовать.</p>
<p>Вот где о них можно узнать:</p>
<ul>
<li><a href="https://coursebuilder.withgoogle.com/sample/course">Мини-курс Power Searching With Google</a> (en). Да, у Гугла есть
онлайн-курс про то, как пользоваться Гуглом (даже два курса). Видео-лекции, домашние задания. Всё серьёзно.
Очень рекомендую: он короткий и очень подробный.</li>
<li><a href="https://www.google.com/intl/en_us/insidesearch/tipstricks/all.html">Google Tips &amp; Tricks</a> (en).</li>
<li><a href="https://habrahabr.ru/sandbox/46956/">Как правильно искать в Google</a>.</li>
<li><a href="http://it2b.ru/blog/arhiv/761.html">Google без секретов (операторы Гугла в практических примерах)</a>.</li>
</ul>