<p>Девман – сборник задач для обучения программированию и теории, необходимой для этого.</p>
<p>У всех задач одни требования:</p>
<ul>
<li>Код на Гитхабе, в форкнутом оригинальном репозитории. Ссылку на него можно найти на странице задачи, справа сбоку.</li>
<li>Только Питон 3.5+.</li>
<li><a href="/encyclopedia/python_basics/python_basics_pep8/">Соблюдение PEP 8</a>.</li>
<li>Все сторонние пакеты должны быть перечислены в файле <code>requirements.txt</code> в корне репозитория.
Устанавливаться должны по команде <code>pip install -r requirements.txt</code>.</li>
<li>Если в репо больше одного <code>py</code>-файла, то в <code>README.md</code> должно быть написано, что и как запускать.</li>
<li>Официальная ОС – Ubuntu 14.04. Легче всего до неё добраться, установив себе или использовав <a href="/encyclopedia/tutorial/tutorial_codenvy/">Кодэнви</a>.</li>
</ul>
<p>Официальный канал связи – общий Слак, все вопросы туда.</p>