<p>Гит – штука для управления кодом. Вместо чтения рекомендую начать с <a href="https://try.github.io">туториала на Гитхабе</a> (en).
Он займёт 15 минут и даст представление о том, что это за зверь и как им пользоваться.</p>
<p>Следующий шаг – <a href="https://githowto.com/ru">туториал на githowto.com</a>, он на русском и куда длиннее.</p>
<p>Гитхаб – это что-то типа Фейсбука для программистов. Код вместо постов, баги вместо котиков. Идиллия.
Чтобы познакомиться с ним ближе, рекомендую выполнить их <a href="https://guides.github.com/activities/hello-world/">Hello World</a>.
После можно пройти <a href="https://guides.github.com/">остальные руководства от Гитхаба</a>, это очень полезные навыки для разработчика.</p>